# SummaryShowsGroups Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..SummaryShowsGroups Property
PanelScheduleData Class See Also
---
Show groups of load classifications in the load summary section
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool SummaryShowsGroups { get; set; }
```

Visual Basic
---
```text
Public Property SummaryShowsGroups As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool SummaryShowsGroups {
	bool get ();
	void set (bool value);
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace